import random as rd
N = [['1','2','3','4'], 
     ['迷克夏 伯爵紅茶拿鐵', '迷克夏 珍珠紅茶拿鐵', '迷克夏 布丁紅茶拿鐵',
    '迷克夏 仙草凍紅茶拿鐵', '迷克夏 紅豆紅茶拿鐵', '迷克夏 珍珠鮮奶',
    '迷克夏 手炒黑糖鮮奶', '迷克夏 大甲芋頭鮮奶', '迷克夏 法芙娜純可可鮮奶',
    '五十嵐 紅茶拿鐵', '五十嵐 綠茶拿鐵', '五十嵐抹茶拿鐵', '可可芭蕾拿鐵'],
     ['迷克夏 茉香綠茶', '迷克夏 大正紅茶', '迷克夏 英倫伯爵紅茶',
    '迷克夏 初露青茶', '迷克夏 高峰烏龍綠', '迷克夏 決明大麥',
    '迷克夏 原鄉冬瓜茶', '迷克夏 青檸香茶', '龍角 阿薩姆紅茶',
    '龍角 茉莉青茶', '龍角 桂花四季春', '五十嵐 黃金烏龍'],
     ['龍角 濃厚奶茶', '龍角 鐵觀音烤奶', '五十嵐 珍珠奶茶',
    '五十嵐 奶綠', '五十嵐 四季奶青'],  ['龍角 自釀醃梅綠',
    '龍角 甜滋滋蜂蜜檸檬', '龍角 百香果三重奏', '五十嵐 旺萊紅',
    '五十嵐 鮮柚綠', '五十嵐 檸檬汁', '葡萄柚多多']]
P = [['1', '2', '3', '4'],
     ['45', '55', '55', '55', '55', '65', '60', '65', '60', '50', '50', '50', '60'],
     ['30', '30', '35', '30', '30', '25', '30', '50', '25', '25', '40', '25'],
     ['35', '40', '40', '40', '40'],
     ['35', '40', '45', '40', '50', '45', '55']]
T = int(input("想喝什麼類型的飲料?(輸入1~4的數字):"))
PM = str(max(P[T]))
Pm = str(min(P[T]))
up = input("請輸入預算(介於"+Pm+"~"+PM+"): ")
Y = "N"
while Y != "Y":
    R = rd.randint(0,len(P[T])-1)
    while P[T][R] > up:
        R = rd.randint(0,len(P[T])-1)
    print(N[T][R],P[T][R],"元")
    Y = input("滿意嗎?(Y/N):")
    while Y != "N" and Y != "Y":
        Y = input("請輸入(Y/N):")
else:
    print("謝謝您的使用")
